// https://leetcode-cn.com/problems/valid-sudoku/
// 请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
// 数字 1-9 在每一行只能出现一次。
// 数字 1-9 在每一列只能出现一次。
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）

// 注意：
// 一个有效的数独（部分已被填充）不一定是可解的。
// 只需要根据以上规则，验证已经填入的数字是否有效即可。
// 空白格用 '.' 表示。

/**
 * @param {character[][]} board
 * @return {boolean}
 */
// 使用Set
var isValidSudoku = function (board) {
	const rows = Array.from({ length: 9 }, () => new Set()),
		cols = Array.from({ length: 9 }, () => new Set()),
		boxs = Array.from({ length: 9 }, () => new Set());
	for (let i = 0; i < 9; i++) {
		for (let j = 0; j < 9; j++) {
			if (board[i][j] === '.') continue;
			const boxIdx = Math.floor(j / 3) + Math.floor(i / 3) * 3,
				num = board[i][j];
			if (rows[i].has(num) || cols[j].has(num) || boxs[boxIdx].has(num)) return false;
			rows[i].add(num);
			cols[j].add(num);
			boxs[boxIdx].add(num);
		}
	}
	return true;
};

var arr1 = [
	['5', '3', '.', '.', '7', '.', '.', '.', '.'],
	['6', '.', '.', '1', '9', '5', '.', '.', '.'],
	['.', '9', '8', '.', '.', '.', '.', '6', '.'],
	['8', '.', '.', '.', '6', '.', '.', '.', '3'],
	['4', '.', '.', '8', '.', '3', '.', '.', '1'],
	['7', '.', '.', '.', '2', '.', '.', '.', '6'],
	['.', '6', '.', '.', '.', '.', '2', '8', '.'],
	['.', '.', '.', '4', '1', '9', '.', '.', '5'],
	['.', '.', '.', '.', '8', '.', '.', '7', '9']
];
console.log(isValidSudoku(arr1)); // true

var arr2 = [
	['8', '3', '.', '.', '7', '.', '.', '.', '.'],
	['6', '.', '.', '1', '9', '5', '.', '.', '.'],
	['.', '9', '8', '.', '.', '.', '.', '6', '.'],
	['8', '.', '.', '.', '6', '.', '.', '.', '3'],
	['4', '.', '.', '8', '.', '3', '.', '.', '1'],
	['7', '.', '.', '.', '2', '.', '.', '.', '6'],
	['.', '6', '.', '.', '.', '.', '2', '8', '.'],
	['.', '.', '.', '4', '1', '9', '.', '.', '5'],
	['.', '.', '.', '.', '8', '.', '.', '7', '9']
];
console.log(isValidSudoku(arr2)); // false

var arr3 = [
	['5', '3', '0', '2', '7', '6', '4', '1', '8'],
	['6', '2', '4', '1', '9', '5', '3', '0', '7'],
	['1', '9', '8', '3', '4', '0', '5', '6', '2'],
	['8', '1', '2', '7', '6', '4', '0', '5', '3'],
	['4', '0', '6', '8', '5', '3', '7', '2', '1'],
	['7', '5', '3', '0', '2', '1', '8', '4', '6'],
	['0', '6', '1', '5', '3', '7', '2', '8', '4'],
	['2', '8', '7', '4', '1', '9', '6', '3', '5'],
	['3', '4', '5', '6', '8', '2', '1', '7', '9']
];
console.log(isValidSudoku(arr3)); // true
